#!/usr/bin/env python

# -*- encoding: utf-8 -*-

"""
@Author  :   Collapsar-G

@License :   (C) Copyright 2021-*

@Contact :   gjf840513468@gmail.com

@File    :   $classes.py

@Time    :   $2021.5.6 $16:50

@Desc    :   数据类型

"""
classes = \
    {
        "0": "其他垃圾/一次性快餐盒",
        "1": "其他垃圾/污损塑料",
        "2": "其他垃圾/烟蒂",
        "3": "其他垃圾/牙签",
        "4": "其他垃圾/破碎花盆及碟碗",
        "5": "其他垃圾/竹筷",
        "6": "厨余垃圾/剩饭剩菜",
        "7": "厨余垃圾/大骨头",
        "8": "厨余垃圾/水果果皮",
        "9": "厨余垃圾/水果果肉",
        "10": "厨余垃圾/茶叶渣",
        "11": "厨余垃圾/菜叶菜根",
        "12": "厨余垃圾/蛋壳",
        "13": "厨余垃圾/鱼骨",
        "14": "可回收物/充电宝",
        "15": "可回收物/包",
        "16": "可回收物/化妆品瓶",
        "17": "可回收物/塑料玩具",
        "18": "可回收物/塑料碗盆",
        "19": "可回收物/塑料衣架",
        "20": "可回收物/快递纸袋",
        "21": "可回收物/插头电线",
        "22": "可回收物/旧衣服",
        "23": "可回收物/易拉罐",
        "24": "可回收物/枕头",
        "25": "可回收物/毛绒玩具",
        "26": "可回收物/洗发水瓶",
        "27": "可回收物/玻璃杯",
        "28": "可回收物/皮鞋",
        "29": "可回收物/砧板",
        "30": "可回收物/纸板箱",
        "31": "可回收物/调料瓶",
        "32": "可回收物/酒瓶",
        "33": "可回收物/金属食品罐",
        "34": "可回收物/锅",
        "35": "可回收物/食用油桶",
        "36": "可回收物/饮料瓶",
        "37": "有害垃圾/干电池",
        "38": "有害垃圾/软膏",
        "39": "有害垃圾/过期药物",
        "40": "可回收物/毛巾",
        "41": "可回收物/饮料盒",
        "42": "可回收物/纸袋",
        "43": "背景",
        "44": "可回收物/废纸",
        "45": "厨余垃圾/胡萝卜",
        "46": "厨余垃圾/苹果",
        "47": "厨余垃圾/青椒",
        "48": "厨余垃圾/圣女果",
        "49": "厨余垃圾/水果局部",
        "50": "其它垃圾/碎瓦片",
        "51": "厨余垃圾/土豆",
    }
class2id2 = \
    {
        "背景": "43",
        "菜叶": "14",
        "电池": "37",
        "废纸": "3",
        "胡萝卜": "45",
        "苹果": "46",
        "青椒": "47",
        "圣女果": "48",
        "水果局部": "49",
        "塑料瓶": "36",
        "碎瓦片": "50",
        "土豆": "51",
        "烟蒂": "2",
        "易拉罐": "23"
    }
id2classes = \
    {
        "0": "背景",
        "1": "厨余垃圾/菜叶",
        "2": "有害垃圾/干电池",
        "3": "可回收物/废纸",
        "4": "厨余垃圾/胡萝卜",
        "5": "厨余垃圾/苹果",
        "6": "厨余垃圾/青椒",
        "7": "厨余垃圾/圣女果",
        "8": "厨余垃圾/水果局部",
        "9": "可回收物/塑料瓶子",
        "10": "其它垃圾/碎瓦片",
        "11": "厨余垃圾/土豆",
        "12": "其他垃圾/烟蒂",
        "13": "可回收物/易拉罐"
    }
class2id = \
    {
        "背景": "0",
        "菜叶": "1",
        "电池": "2",
        "废纸": "3",
        "胡萝卜": "4",
        "苹果": "5",
        "青椒": "6",
        "圣女果": "7",
        "水果局部": "8",
        "塑料瓶": "9",
        "碎瓦片": "10",
        "土豆": "11",
        "烟蒂": "12",
        "易拉罐": "13"
    }
